<template>
  <div class="mainmenu">
    <div class="mainmenu-content">
      <h2>Главное меню</h2>
      <div class="btn" @click="startNewGame">Начать новую игру</div>
      <div>
        <p>
          Пираты орки напали на корабль с людьми и захватили их. Выжили не все, а тех кто выжил захватили в плен.
          Герой игры был одним из захваченных в плен. Его имя Джор Джаррус. Захваченных посадили в тюрьму и по
          одному отправляли в местные подземелья для расчистки их от гоблинов, живущих там и охраняющих множество
          ценных вещей.
          Сами орки только надежно охраняли выход из пещеры, чтобы у жертв был только один выход –
          продвигаться в глубь пещер.
        </p>
        <p>Цель: спасти экипаж корабля.</p>
      </div>
    </div>
  </div>
</template>

<script>
import Vuex from 'vuex';

export default {
  name: "MainMenu",
  methods: {
    ...Vuex.mapMutations([
      'startNewGame',
    ]),
  }
};
</script>
